app/views/profiles/show.html.erb

           <p>Booked offers:</p>
           <% offer.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."offer_id" = $1  [["offer_id", 32]]