app/controllers/bookings_controller.rb

INSERT INTO "bookings" ("user_id", "offer_id", "created_at", "updated_at", "date") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 18], ["offer_id", 32], ["created_at", 2016-11-29 23:41:28 UTC], ["updated_at", 2016-11-29 23:41:28 UTC], ["date", Tue, 12 Jan 2016]]
---
  def create
    booking = @offer.bookings.build(booking_params)
    booking.user_id = @user
    booking.offer = @offer
    if booking.save

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_offer
    @offer = Offer.find(params[:offer_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def find_user
    @user = User.find(params[:user_id])