app/controllers/offers_controller.rb

SELECT offers.*, 6371.0 * 2 * ASIN(SQRT(POWER(SIN((41.3850639 - offers.latitude) * PI() / 180 / 2), 2) + COS(41.3850639 * PI() / 180) * COS(offers.latitude * PI() / 180) * POWER(SIN((2.1734035 - offers.longitude) * PI() / 180 / 2), 2))) AS distance, MOD(CAST((ATAN2( ((offers.longitude - 2.1734035) / 57.2957795), ((offers.latitude - 41.3850639) / 57.2957795)) * 57.2957795) + 360 AS decimal), 360) AS bearing FROM "offers" WHERE (offers.latitude BETWEEN 41.29513173940813 AND 41.47499606059187 AND offers.longitude BETWEEN 2.0535392512645823 AND 2.293267748735418 AND (6371.0 * 2 * ASIN(SQRT(POWER(SIN((41.3850639 - offers.latitude) * PI() / 180 / 2), 2) + COS(41.3850639 * PI() / 180) * COS(offers.latitude * PI() / 180) * POWER(SIN((2.1734035 - offers.longitude) * PI() / 180 / 2), 2)))) BETWEEN 0.0 AND 10) AND (category = 'Programming') ORDER BY distance ASC
---
  def index
    @category = params["/offers"]["category"]
    @location = params["/offers"]["location"]
    # @offers = Offer.where(["category = ? and location = ?", @category, @location])
    @offers = Offer.near(@location, 10).where(["category = ?", @category])

SELECT  "offers".* FROM "offers" WHERE "offers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @offer = Offer.find(params[:id])

INSERT INTO "offers" ("user_id", "price", "title", "description", "seniority", "category", "created_at", "updated_at", "latitude", "longitude", "address", "zip_code", "city", "country") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
  def create
    @offer = Offer.new(offer_params)
    @offer.user = current_user
    if @offer.save